app/views/sections/index.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."project_id" = $1 AND "roles"."role" = $2 LIMIT $3  [["project_id", 8], ["role", "admin"], ["LIMIT", 1]]
---
<% @project_admin = Role.find_by(project_id: @project.id, role: 'admin').user %>