app/views/projects/index.html.erb

SELECT  "sections".* FROM "sections" WHERE "sections"."project_id" = $1 LIMIT $2  [["project_id", 1], ["LIMIT", 1]]
---
        <h3><%= link_to project.title, project %></h3>
        <% section = Section.find_by(project_id: project.id)%>