app/controllers/conversations_controller.rb

SELECT "users".* FROM "users"
---
  def new
    @recipients = User.all - [current_user]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    recipient = User.find(params[:user_id])