app/controllers/messages_controller.rb

  def create
    if Project.find_by(mailboxer_conversation_id: params[:conversation_id]).present?
      @project = Project.find_by(mailboxer_conversation_id: params[:conversation_id])
      @project_admin = Role.find_by(project_id: @project.id, role: 'admin').user
      @conversation = @project_admin.mailbox.conversations.find(@project.mailboxer_conversation_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."mailboxer_conversation_id" = $1 LIMIT $2  [["mailboxer_conversation_id", 2], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."project_id" = $1 AND "roles"."role" = $2 LIMIT $3  [["project_id", 1], ["role", "admin"], ["LIMIT", 1]]
SELECT  "mailboxer_conversations".* FROM "mailboxer_conversations" WHERE "mailboxer_conversations"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]