app/controllers/projects_controller.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."project_id" = $1 AND "roles"."role" = $2 LIMIT $3  [["project_id", 6], ["role", "admin"], ["LIMIT", 1]]
---
  def show
    @project_admin = Role.find_by(project_id: @project.id, role: 'admin').user

INSERT INTO "roles" ("user_id", "project_id", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["project_id", 27], ["role", "admin"], ["created_at", 2016-06-30 02:21:29 UTC], ["updated_at", 2016-06-30 02:21:29 UTC]]
INSERT INTO "mailboxer_conversations" ("subject", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["subject", "subject"], ["created_at", 2016-06-30 02:21:29 UTC], ["updated_at", 2016-06-30 02:21:29 UTC]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

        role = Role.create({
          user: current_user,
          project: @project,
          role: 'admin'
          })

        receipt = current_user.send_message(nil, " created the project", "#{@project.title}")
        @project.mailboxer_conversation_id = receipt.conversation.id
        @project.save