app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at DESC
---
  def index
    @projects = Project.all

SELECT "sections".* FROM "sections" WHERE "sections"."project_id" = $1 ORDER BY created_at DESC  [["project_id", 1]]
---
  def show
    @sections = Section.where(project_id: @project.id)

INSERT INTO "projects" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2016-06-28 13:28:09 UTC], ["updated_at", 2016-06-28 13:28:09 UTC]]
INSERT INTO "roles" ("user_id", "project_id", "type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 6], ["project_id", 3], ["type", "admin"], ["created_at", 2016-06-28 13:28:09 UTC], ["updated_at", 2016-06-28 13:28:09 UTC]]
---
  def new
    @project = Project.new
    role = Role.create({
      user: current_user,
      project: @project,
      role: 'admin'
      })

SELECT  "roles".* FROM "roles" WHERE "roles"."project_id" = $1 AND "roles"."type" = $2 ORDER BY "roles"."id" ASC LIMIT $3  [["project_id", 6], ["type", "admin"], ["LIMIT", 1]]
---
  def edit
    project_admin = Role.find_by(project_id: @project.id, role: 'admin').user_id

INSERT INTO "projects" ("title", "overview", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title 1"], ["overview", "This is an overview of a project"], ["created_at", 2016-06-28 12:52:27 UTC], ["updated_at", 2016-06-28 12:52:27 UTC]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "title" = $1, "overview" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["title", "Title 3"], ["overview", "Lorem goes here"], ["updated_at", 2016-06-28 13:28:32 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)