app/controllers/roles_controller.rb

INSERT INTO "roles" ("user_id", "project_id", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["project_id", 7], ["role", "collaborator"], ["created_at", 2016-06-28 16:47:44 UTC], ["updated_at", 2016-06-28 16:47:44 UTC]]
---
  def create
    @role = Role.create({
      user_id: current_user.id,
      project_id: 8,
      role: 'collaborator'
      })