app/controllers/sections_controller.rb

  def create
    @section = Section.new(section_params)
    @section.user = current_user
    @section.project_id = @project.id

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("project_id", "user_id", "header", "description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @section.update(section_params)
---
UPDATE "sections" SET "description" = $1, "updated_at" = $2 WHERE "sections"."id" = $3  [["description", "Across the Universe2"], ["updated_at", 2016-06-29 18:09:32 UTC], ["id", 9]]

  def destroy
    @section.destroy
---
DELETE FROM "sections" WHERE "sections"."id" = $1  [["id", 1]]

  def set_section_project
    @project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]